import SlidingModal from "@/components/kit/SlidingModal";
import type { ModalProp } from "@/pages/InsuranceDetail/insuranceDetail.types";
import { InfoIcon, Undo2Icon } from "lucide-react";


export default function Index({ isOpen, setIsOpen }: ModalProp) {

    return <SlidingModal isOpen={isOpen} setIsOpen={setIsOpen}>
        <section className="px-2 py-4 text-sm leading-8">
            <section className="flex gap-2 items-center">
                <InfoIcon className="text-blue-500" />
                <span className="text font">در زمان تعیین نتیجه به موارد زیر توجه فرمایید:</span>
            </section>
            <ul className="list-disc mt-5 font-light">
                <li><strong>تعیین مکان انجام شد: </strong>در صورتیکه محل بیمه‌نامه و یا اقلام آن به درستی تعیین شده باشد. همچنین در مواردی که مورد بیمه یافت نشد باید اعلام شود</li>
                <li><strong>آدرس اشتباه است:  </strong>در صورت اشتباه بودن آدرس اعلام شده باید اقدام به ثبت محل صحیح نموده و تعیین مکان توسط ارزیاب جاری انجام نشود. بیمه نامه برای تعیین بسته در آتی در صف انتظار قرار می گیرد و از کارتابل ارزیاب جاری خارج خواهد شد. بعد از گذشت مدتی بیمه‌نامه به بخش بسته‌های پیوست فنی آدرس جدید منتقل می‌شود.</li>
                <li><strong>بیمه‌نامه باید ابطال و انفساخ شود:</strong>در صورت مغایرت کامل همه اقلام بیمه‌نامه با ضوابط بیمه باید اقدام به درخواست ابطال بیمه‌نامه شود. در این شرایط بعد از تایید شعبه و ... بیمه‌نامه ابطال خواهد شد.</li>
                <li><strong>بیمه‌نامه تکراری است: </strong>در صورت اشتباه کارگزار در صدور بیمه‌نامه تکراری، جهت عودت حق بیمه به بیمه‌گذار، مورد به شعبه ارجاع داده خواهد شد.</li>
                <li><strong>ارجاع به ارزیاب همکار:</strong>در صورتی که در همین محل (آبادی یا شهر) ارزیاب دیگری به عنوان ارزیاب پیوست فنی بیمه‌نامه‌های همین موضوع توسط مدیریت استان تعیین شده باشد ارسال پرونده به کارتابل ارزیاب دیگر ممکن خواهد بود                    </li>
                <li><strong>ارجاع به ارزیاب همکار:</strong>در صورتی که در همین محل (آبادی یا شهر) ارزیاب دیگری به عنوان ارزیاب پیوست فنی بیمه‌نامه‌های همین موضوع توسط مدیریت استان تعیین شده باشد ارسال پرونده به کارتابل ارزیاب دیگر ممکن خواهد بود                    </li>
                <li><strong>ارائه به کمک‌ارزیاب:</strong>جهت ارائه بیمه‌نامه به کمک‌ارزیابان (سایر کارگزاران فعال) برای ثبت اطلاعات مکانی از این گزینه استفاده شود</li>
                <li><strong>عدم همکاری بیمه‌گذار یا ذینفع:</strong>در صورت عدم همکاری بیمه‌گذار یا ذینفع در شناسایی محل بیمه‌نامه و یا ... بعد از تایید شعبه (تهیه صورت جلسه با ناظر و شعبه و الصاق به مستندات بیمه‌نامه) می‌توانید این گزینه را انتخاب نمایید</li>
                <li><strong>عدم مراجعه و تکمیل پرونده:</strong>در مواردی که مطابق دستورالعمل یا اعلام مدیریت استان به دلایل صعب العبور بودن و یا ... می‌توانید مراجعه و تعیین مکان را موکول به زمان وقوع اولین خسارت نمایید. قطعا این مورد در زمان پرداخت کارمزد توسط مدیریت استان لحاظ خواهد گردید.</li>
                <li><strong>توقف عملیات:</strong>در مواردی که نیاز است عملیات پیوست فنی به صورت موقت متوقف شده تا کاری انجام شود از این بخش استفاده کنید (مثلا صدور بیمه‌نامه ارتقایی، ...)</li>
            </ul>
            <button onClick={() => setIsOpen(false)} className="bg-white mr-auto border border-primary w-[120px] text-primary flex justify-center items-center gap-2 rounded-full py-2 px-1 text-sm">
                <span>بازگشت</span>
                <Undo2Icon className="w-[20px]" />
            </button>
        </section>
    </SlidingModal>
}
